~/test-1-SHRAVAN-RAO-18$ gcc -g p2final.c
~/test-1-SHRAVAN-RAO-18$ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) break main
Breakpoint 1 at 0x722: file p2final.c, line 4.
(gdb) r
Starting program: /home/runner/test-1-SHRAVAN-RAO-18/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2final.c:4
4   {
(gdb) n
6     printf("enter two numbers");
(gdb) n
7     scanf("%d %d",&a,&b);
(gdb) n
enter two numbersn
8     sum=add(a,b);
(gdb) s
add (a=22060, b=-836316656) at p2final.c:16
16    c=a+b;
(gdb) n
17    return c;
(gdb) n
18  }(gdb) n
main () at p2final.c:9
9     printf("the sum of the given number is %d",sum);
(gdb) n
10    return 0;
(gdb) n
11  }
(gdb) c
Continuing.
the sum of the given number is -836294596[Inferior 1 (process 149) exited normally]
(gdb) 